In [1]:
import pandas as pd

<h3>Series</h3>

In [3]:
s=pd.Series([34,5,23,234,547,22,56])

In [5]:
s

0     34
1      5
2     23
3    234
4    547
5     22
6     56
dtype: int64

In [8]:
type(s)

pandas.core.series.Series

In [10]:
#accessing content from the series
s[2]

23

In [12]:
s.shape

(7,)

In [30]:
s.size
s

0     34
1      5
2     23
3    234
4    547
5     22
6     56
dtype: int64

In [22]:
s.dtype

dtype('int64')

In [24]:
import numpy as np

In [26]:
s1=pd.Series([12,23,34,45,56,54,78,24],index=range(100,108),dtype=np.int8)
s1

100    12
101    23
102    34
103    45
104    56
105    54
106    78
107    24
dtype: int8

In [32]:
s1[104]

56

In [34]:
s1.min()

12

In [36]:
s1.max()

78

In [40]:
s1.mean()

40.75

In [42]:
s1.sum()

326

In [44]:
s1.std()

21.651459865000195

<h3>Data Frame</h3>

In [116]:
#mitu.co.in/dataset
r=pd.Series([1,2,3,4,5])
n=pd.Series(['ajay','ram','ojas','venky','nitin'])
m=pd.Series([64.8,73.9,22.6,63.7,25.5])

In [118]:
df=pd.DataFrame({
    'roll':r,
    'name':n,
    'marks':m
})

In [120]:
df.head()

   roll   name  marks
0     1   ajay   64.8
1     2    ram   73.9
2     3   ojas   22.6
3     4  venky   63.7
4     5  nitin   25.5

In [122]:
df.name[3],df.marks[3]

('venky', 63.7)

In [124]:
df.shape

(5, 3)

In [126]:
df.size

15

In [128]:
df.ndim

2

In [130]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [132]:
import os
os.getcwd()

'C:\\Users\\duasp\\students'

In [134]:
ls

 Volume in drive C has no label.
 Volume Serial Number is 985B-2269

 Directory of C:\Users\duasp\students

09/24/2024  03:22 PM    <DIR>          .
09/24/2024  03:22 PM    <DIR>          ..
09/24/2024  03:21 PM               200 student1.csv
09/24/2024  03:21 PM               212 student2.csv
09/24/2024  03:21 PM               341 student3.csv
09/24/2024  03:21 PM               226 student3.tsv
09/24/2024  03:21 PM               343 student4.csv
09/24/2024  03:21 PM               132 student5.csv
09/24/2024  03:21 PM            35,078 students.json
               7 File(s)         36,532 bytes
               2 Dir(s)  162,348,408,832 bytes free

In [159]:
df=pd.read_csv('student.csv')

In [161]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [163]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [165]:
df.shape

(10, 5)

In [197]:
df2=pd.read_csv('student1.csv',names=['Roll no','Name','Year','marks','Age'])

In [199]:
df2

   Roll no     Name Year  marks  Age
0        1     anil   TE  56.77   22
1        2     amit   TE  59.77   21
2        3   aniket   BE  76.88   19
3        4  ajinkya   TE  69.66   20
4        5     asha   TE  63.28   20
5        6   ayesha   BE  49.55   20
6        7     amar   BE  65.34   19
7        8    amita   BE  68.33   23
8        9     amol   TE  56.75   20
9       10    anmol   BE  78.66   21

In [213]:
df3=pd.read_csv('student3.tsv',sep='\t')

In [215]:
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [217]:
iris=pd.read_csv('https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/0e7a9b0a5d22642a06d3d5b9bcbad9890c8ee534/iris.csv')

In [237]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

#slysing operation, individual col is a series

In [246]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [239]:
iris.shape

(150, 5)

In [241]:
iris.size

750

In [248]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [250]:
df.shape

(10, 5)

In [252]:
df.values

array([[1, 'anil', 'TE', 56.77, 22],
       [2, 'amit', 'TE', 59.77, 21],
       [3, 'aniket', 'BE', 76.88, 19],
       [4, 'ajinkya', 'TE', 69.66, 20],
       [5, 'asha', 'TE', 63.28, 20],
       [6, 'ayesha', 'BE', 49.55, 20],
       [7, 'amar', 'BE', 65.34, 19],
       [8, 'amita', 'BE', 68.33, 23],
       [9, 'amol', 'TE', 56.75, 20],
       [10, 'anmol', 'BE', 78.66, 21]], dtype=object)

In [254]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [256]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [258]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [269]:
df.loc[9]

roll        10
name     anmol
class       BE
marks    78.66
age         21
Name: 9, dtype: object

In [271]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

#slicing index based

In [279]:
x=df.iloc[2:9,1:5]
x

      name class  marks  age
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20

In [284]:
df.iloc[4:,:4]

   roll    name class  marks
4     5    asha    TE  63.28
5     6  ayesha    BE  49.55
6     7    amar    BE  65.34
7     8   amita    BE  68.33
8     9    amol    TE  56.75
9    10   anmol    BE  78.66

In [288]:
df.iloc[:,:4]

   roll     name class  marks
0     1     anil    TE  56.77
1     2     amit    TE  59.77
2     3   aniket    BE  76.88
3     4  ajinkya    TE  69.66
4     5     asha    TE  63.28
5     6   ayesha    BE  49.55
6     7     amar    BE  65.34
7     8    amita    BE  68.33
8     9     amol    TE  56.75
9    10    anmol    BE  78.66

In [290]:
df.iloc[1:,:2]

   roll     name
1     2     amit
2     3   aniket
3     4  ajinkya
4     5     asha
5     6   ayesha
6     7     amar
7     8    amita
8     9     amol
9    10    anmol

In [292]:
df.iloc[[4,7,6,2],:]

   roll    name class  marks  age
4     5    asha    TE  63.28   20
7     8   amita    BE  68.33   23
6     7    amar    BE  65.34   19
2     3  aniket    BE  76.88   19

In [294]:
df.iloc[[4,2,1],[4,2,3]]

   age class  marks
4   20    TE  63.28
2   19    BE  76.88
1   21    TE  59.77

In [298]:
df.iloc[5,2:4]

class       BE
marks    49.55
Name: 5, dtype: object

In [302]:
df.iloc[[5],:]

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20

In [304]:
df.iloc[:,[1]]

      name
0     anil
1     amit
2   aniket
3  ajinkya
4     asha
5   ayesha
6     amar
7    amita
8     amol
9    anmol

<h3>Label Based Slicing</h3>

In [311]:
df.loc[:,["name"]]

      name
0     anil
1     amit
2   aniket
3  ajinkya
4     asha
5   ayesha
6     amar
7    amita
8     amol
9    anmol

In [313]:
df.loc[:,["name","marks"]]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [317]:
df["name"]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [321]:
df[["name", "marks"]]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [354]:
df.drop([5,9,2])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20

In [362]:
df.drop(["class"],axis=1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [360]:
df.drop(["class","age"],axis=1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [364]:
#functions

In [366]:
df["marks"].count()

10

In [370]:
df["marks"].mean()

64.499

In [374]:
df["marks"].min()

49.55

In [376]:
df["marks"].median()

64.31

In [378]:
df["marks"].argmax()

9

In [380]:
df["marks"].argmin()

5

In [382]:
df["marks"].std()

9.207178901994535

In [384]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [386]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [391]:
df['class'].mode()

0    BE
1    TE
Name: class, dtype: object

In [394]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [403]:
df.min(),df.max()

(roll           1
 name     ajinkya
 class         BE
 marks      49.55
 age           19
 dtype: object,
 roll         10
 name     ayesha
 class        TE
 marks     78.66
 age          23
 dtype: object)

In [410]:
df.mean(numeric_only=True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [414]:
df.mean(numeric_only=True, axis=1)

0    26.590000
1    27.590000
2    32.960000
3    31.220000
4    29.426667
5    25.183333
6    30.446667
7    33.110000
8    28.583333
9    36.553333
dtype: float64

<h3>Custom Column Operations</h3>

In [417]:
df['marks']/10

0    5.677
1    5.977
2    7.688
3    6.966
4    6.328
5    4.955
6    6.534
7    6.833
8    5.675
9    7.866
Name: marks, dtype: float64

In [423]:
df['marks']=df['marks']+0.5
df

   roll     name class  marks  age
0     1     anil    TE  57.27   22
1     2     amit    TE  60.27   21
2     3   aniket    BE  77.38   19
3     4  ajinkya    TE  70.16   20
4     5     asha    TE  63.78   20
5     6   ayesha    BE  50.05   20
6     7     amar    BE  65.84   19
7     8    amita    BE  68.83   23
8     9     amol    TE  57.25   20
9    10    anmol    BE  79.16   21

In [425]:
df['cgpa']=df['marks']/10+0.27
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  57.27   22  5.997
1     2     amit    TE  60.27   21  6.297
2     3   aniket    BE  77.38   19  8.008
3     4  ajinkya    TE  70.16   20  7.286
4     5     asha    TE  63.78   20  6.648
5     6   ayesha    BE  50.05   20  5.275
6     7     amar    BE  65.84   19  6.854
7     8    amita    BE  68.83   23  7.153
8     9     amol    TE  57.25   20  5.995
9    10    anmol    BE  79.16   21  8.186

In [435]:
x = ['M','M','M','M','F','F','M','M','M','M']

In [437]:
df["gender"] = x

In [439]:
df

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  57.27   22  5.997      M
1     2     amit    TE  60.27   21  6.297      M
2     3   aniket    BE  77.38   19  8.008      M
3     4  ajinkya    TE  70.16   20  7.286      M
4     5     asha    TE  63.78   20  6.648      F
5     6   ayesha    BE  50.05   20  5.275      F
6     7     amar    BE  65.84   19  6.854      M
7     8    amita    BE  68.83   23  7.153      M
8     9     amol    TE  57.25   20  5.995      M
9    10    anmol    BE  79.16   21  8.186      M

In [443]:
df=pd.read_csv('student.csv')

In [445]:
ndf=pd.DataFrame({
    'roll':range(1,11),
    'cgpa':df['marks']/10+0.27,
    'gender':['M','M','M','M','F','F','M','F','M','M']
})

In [447]:
ndf

   roll   cgpa gender
0     1  5.947      M
1     2  6.247      M
2     3  7.958      M
3     4  7.236      M
4     5  6.598      F
5     6  5.225      F
6     7  6.804      M
7     8  7.103      F
8     9  5.945      M
9    10  8.136      M

In [449]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [453]:
df.shape,ndf.shape

((10, 5), (10, 3))

In [455]:
df.merge(ndf, on='roll')

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  56.77   22  5.947      M
1     2     amit    TE  59.77   21  6.247      M
2     3   aniket    BE  76.88   19  7.958      M
3     4  ajinkya    TE  69.66   20  7.236      M
4     5     asha    TE  63.28   20  6.598      F
5     6   ayesha    BE  49.55   20  5.225      F
6     7     amar    BE  65.34   19  6.804      M
7     8    amita    BE  68.33   23  7.103      F
8     9     amol    TE  56.75   20  5.945      M
9    10    anmol    BE  78.66   21  8.136      M

In [460]:
df5=pd.read_csv('student5.csv')

In [462]:
df5

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [464]:
df5.shape

(5, 5)

In [468]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [470]:
df5.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [474]:
pd.concat([df,df5], ignore_index=True)

    roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

<h3>Grouping and aggregation</h3>

In [477]:
gr=df.groupby('class')

In [481]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [483]:
gr.get_group('TE')

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [487]:
gr['marks'].max()

class
BE    78.66
TE    69.66
Name: marks, dtype: float64

In [494]:
gr['roll'].median()

class
BE    7.0
TE    4.0
Name: roll, dtype: float64

In [496]:
gr['age'].value_counts()

class  age
BE     19     2
       20     1
       21     1
       23     1
TE     20     3
       21     1
       22     1
Name: count, dtype: int64

In [498]:
gr.min()

       roll     name  marks  age
class
BE        3     amar  49.55   19
TE        1  ajinkya  56.75   20

In [502]:
gr.describe()

       roll                                          marks          ...  \
      count mean       std  min  25%  50%  75%   max count    mean  ...
class                                                               ...
BE      5.0  6.8  2.588436  3.0  6.0  7.0  8.0  10.0   5.0  67.752  ...
TE      5.0  4.2  3.114482  1.0  2.0  4.0  5.0   9.0   5.0  61.246  ...

                      age
         75%    max count  mean       std   min   25%   50%   75%   max
class
BE     76.88  78.66   5.0  20.4  1.673320  19.0  19.0  20.0  21.0  23.0
TE     63.28  69.66   5.0  20.6  0.894427  20.0  20.0  20.0  21.0  22.0

[2 rows x 24 columns]